Revit 2026 API

# ParameterMapErase Method

---

Removes a object with the specified key from the map.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual int Erase(
	string key
)
```
```vb
Public Overridable Function Erase (
	key As String
) As Integer
```
```cpp
public:
virtual int Erase(
	String^ key
)
```
```fsharp
abstract Erase :
        key : string -> int
override Erase :
        key : string -> int
```

#### Parameters

key String
    The key of the item to be erased.

#### Return Value

Int32The number of items that were erased from the map.

#### Reference

ParameterMap Class

Autodesk.Revit.DB Namespace